2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application simpleFoam;

startFrom          startTime;
startTime          0;
stopAt            endTime;
endTime            1;
deltaT            1e-6;
writeControl      timeStep;
writeInterval      100;
purgeWrite        0;
writeFormat       binary;
writePrecision    6;
writeCompression  on;
timeFormat        general;
timePrecision     6;
runTimeModifiable yes;

libs ( "libOpenFOAM.so" "libgroovyBC.so" ) ;
// ************************************************************************* //
